app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-07-04 16:35:57.756856"], ["updated_at", "2016-07-04 16:35:57.756856"]]
---
  def create
    # Grab the params
    @post = Post.create(params[:id])